REALITY_DATA = {
    "看护人": {
        "trigger": "被需要",
        "trigger_desc": "GM可以利用现实触发器使你的依赖对象急需关注。如果你忽视这一信号，你的依赖对象会立即大发脾气，并在之后要求你投入更多时间：与你的依赖对象最缺乏交谊的那段关系将失去一点连接",
        "burnout": "这是你最爱的！",
        "burnout_desc": "当你在做某件能让你的依赖对象感到愉悦的事情时，忽略所有燃尽",
        "track_name": "独立",
        "track_desc": "如果你让你的依赖对象独自处理问题、任由他们受到伤害，或将他们置于他人监管之下，你们之间的关系会受到损害。此时，请在四格“独立”轨迹中勾选下一个空格。当所有格子都被勾选，或者他们成长到超出了你的掌控时，你的依赖对象将不再依赖于你——你必须选择一个新的现实"
    },
    "卷王": {
        "trigger": "工作手机",
        "trigger_desc": "你拥有一部专门用于你职业的智能手机。GM可利用现实触发器让你某段人际关系随时打这个电话。如果你忽视了该电话，该关系将失去一点连接",
        "burnout": "穿针引线",
        "burnout_desc": "当你在从事与职业相关的工作或练习时，忽略所有燃尽",
        "track_name": "有什么事变化了",
        "track_desc": "如果你未能履行你职业的必要职责，或丢失了手机，请在四格“有什么事变化了”轨迹中标记一个空格。当所有格子都被标记时，你的职业将不可逆转地终止。如果因这种方式或其他方式结束，你必须选择一个新的现实"
    },
    "被追捕者": {
        "trigger": "身陷追踪",
        "trigger_desc": "GM可以利用现实触发器来突出一个认出你的人，他们会向追捕你的人汇报。如果你不花时间让对方无法追踪你，他们就会开始挖掘你的私生活。最不熟悉你的关系失去一点连接，并在下次与你的互动场景中向你提出一些尖锐的问题",
        "burnout": "不是我",
        "burnout_desc": "当你在做任何能掩盖自己行踪的事情时，忽略所有燃尽",
        "track_name": "被抓住",
        "track_desc": "如果你向会认出你的人暴露自己的新身份或地点，请在四格“被抓住”轨迹中标记一个空格。当所有格子都已标记，或者你的过去终于找上门来（无论是由于该效果还是其他因素），你必须选择新的现实"
    },
    "明星": {
        "trigger": "你最狂热的粉丝",
        "trigger_desc": "你到处都有粉丝，他们都想尽办法得到你的注意。GM可以利用这个现实触发器，让某个人认出你并疯狂地想要吸引你的关注。如果你对他们视而不见，他们会当场制造一番混乱，之后还会在网上抱怨：那个因你失势而损失最大的关系会因此失去一点连接",
        "burnout": "尽情享受",
        "burnout_desc": "当你做出某些能彰显你的优势或证明你价值的行为时，忽略所有燃尽",
        "track_name": "过气",
        "track_desc": "如果你做了什么损害自身名誉的事，你的明星光环便开始黯淡。请在四格“过气”轨迹中标记一个空格。当所有格子都被标记，或者你放弃了你的目标，你的明星之路就此终结：你必须选择新的现实"
    },
    "拮据者": {
        "trigger": "钱包里的苍蝇",
        "trigger_desc": "拮据者从来没有足够的钱，而这个世界消费高昂。GM可以利用现实触发器让某项你必须支付的费用（比如出租车费、入场费等）超出你的承受范围。若你找不到办法逃避支付，就只能向朋友借钱：你可以任选一段关系，它会因此失去一点连接",
        "burnout": "一毛不拔",
        "burnout_desc": "当你在做能让你占到便宜的事情时，忽略所有燃尽",
        "track_name": "一无所有",
        "track_desc": "当你获得一大笔钱时，这笔钱很快就会耗尽在你所背负的债务上。此时，请在四格“一无所有”轨迹中标记一个空格。当四格均被标记，或你找到一种方法可以永久逃避这些责任，你必须选择新的现实"
    },
    "新生者": {
        "trigger": "仍在学习",
        "trigger_desc": "GM可以利用现实触发器让你忘记或从未学会某项日常技能。你当下无法完成这个动作，必须寻求他人协助或另辟蹊径。若你没有花时间去找到解决办法，你会因难堪而退缩：你最在意其看法的那段关系将失去一点连接",
        "burnout": "如同归家",
        "burnout_desc": "当你在做一些能让世界更像你自身归属的事情时，忽略所有燃尽",
        "track_name": "自我塑造",
        "track_desc": "如果你为适应世界而改变自我，请在四格“自我塑造”轨迹中勾选一个空格。当四格均被标记，或你找到了彻底逃避这些责任的办法，你必须选择新的现实" #我有点怀疑此处“逃避责任”的描述是不是给错了？
    },
    "恋爱脑": {
        "trigger": "糟糕，他/她太吸引人了",
        "trigger_desc": "你无法忽视出现的机遇。GM可以利用现实触发器让你感觉到一丝“氛围”——这种氛围可能是真实的，也可能是你想象出来的。如果你没把握住这个“机会”，你就会纠结于这次错过的邂逅，无法专心投入当下：你最接近“真实情感”的那段关系因此失去一点连接",
        "burnout": "对，我就是很迷人",
        "burnout_desc": "当你在做某些能让你看起来更具吸引力或更惹人怜爱之事时，忽略所有燃尽",
        "track_name": "安顿下来",
        "track_desc": "每当一段现有关系阻碍你探索新的可能性时，请在四格“安顿下来”轨迹中勾选一个空格。当四格均被标记，说明你知道自己在寻找什么，甚至可能已经找到了。你必须选择新的现实"
    },
    "顶梁柱": {
        "trigger": "无尽责任",
        "trigger_desc": "GM可以用现实触发器使你的一位组织成员在任何时刻向你提出需求。如果你对其视而不见，你在组织内部的形象就会大受影响，且任何了解你组织的人也会对你评价下降：你的继任者（见“人际关系”）的扮演者选择的一段关系失去一点连接",
        "burnout": "这是我的名片",
        "burnout_desc": "当你在做任何能扩大组织影响力的事情时，忽略所有燃尽",
        "track_name": "被排挤",
        "track_desc": "如果你违反了组织的规则或让其他成员感到尴尬，请在四格“被排挤”轨迹中勾选一个空格。当四格均被标记，或者你主动让位，你的继任者将接管组织，而你必须选择新的现实"
    },
    "异类": {
        "trigger": "此刻就必须",
        "trigger_desc": "你的真实自我拥有无法与他人分享的需求。GM可以利用现实触发器让这些欲望浮现在你脑海之中。如果你强行压抑这种渴求，你会因为意志力的消耗而与他人沟通不畅：对你的伪装最为深信不疑的那段关系失去一点连接",
        "burnout": "悄然无声",
        "burnout_desc": "当你在做某些能让自己显得不那么特别的事情时，忽略所有燃尽",
        "track_name": "暴露",
        "track_desc": "如果有人知晓或你亲口承认了自己的真实身份，请在四格“暴露”轨迹中勾选一个空格。当所有格子都被勾选，或当你以无法挽回的方式被公之于众，你的伪装便不再起效。如果你还能继续工作，就必须选择一个新的现实"
    }
}

COMPETENCY_DATA = {
    "公关": {
        "directive": "保持一切光明正大",
        "directive_desc": "每当你撒谎时，收到一次处分",
        "behaviors": ["制造一场干扰", "给出一个绝妙的借口", "确保对方从此对这件事三缄其口"]
    },
    "研发": {
        "directive": "推陈出新",
        "directive_desc": "每当你重复同一行为时，收到一次处分",
        "behaviors": ["探明某人真正需要的东西", "重新发明轮子", "不可逆转地彻底改变某人的生活"]
    },
    "咖啡师": {
        "directive": "保持氛围新鲜",
        "directive_desc": "每当你准确说出某人的名字时，收到一次处分",
        "behaviors": ["让某人感到宾至如归", "展示你的专业知识", "让血液加速流动"]
    },
    "CEO": {
        "directive": "维护等级秩序",
        "directive_desc": "每当你听从一次指令时，收到一次处分",
        "behaviors": ["迫使某人按照你的意愿行事", "享受更高层次的奢侈", "做出必要的牺牲"]
    },
    "实习生": {
        "directive": "他们不会无缘无故让你做事",
        "directive_desc": "每当你拒绝一个请求时，收到一次处分",
        "behaviors": ["自信地失败", "使自己出糗供他人获益", "让某事轰然停摆"]
    },
    "掘墓人": {
        "directive": "别让无辜者双手染污",
        "directive_desc": "每当你触碰到任何活物时，收到一次处分",
        "behaviors": ["挖掘丑闻", "清理烂摊子", "埋葬问题"]
    },
    "前台接待": {
        "directive": "时刻保持警惕",
        "directive_desc": "（二选一）\n每当你坐下时，收到一次处分\n每当你留下一个未回答的问题时，收到一次处分",
        "behaviors": ["审问某人", "征用他人财物", "彻底关闭一扇门"]
    },
    "客服": {
        "directive": "绝不要说“很遗憾”",
        "directive_desc": "每当你带来坏消息时，收到一次处分",
        "behaviors": ["帮助他人卸下心理包袱", "承担并非你所犯的过失", "将某人引向一个出乎意料的命运"]
    },
    "小丑": {
        "directive": "让大家保持欢笑",
        "directive_desc": "每当你谈起感受时，收到一次处分",
        "behaviors": ["上演一场好戏", "揭露令人尴尬的真相", "强行让对方露出笑容"]
    }
}

ANOMALY_NAMES = ["低语", "编目", "渴渠", "时计", "生长", "枪", "梦境", "流形", "缺失"]

QUALITY_ASSURANCES = {
    "attentiveness": "缜密",
    "duplicity": "欺瞒",
    "dynamism": "活力",
    "empathy": "共情",
    "initiative": "主动",
    "persistence": "坚持",
    "presence": "气质",
    "professionalism": "专业",
    "subtlety": "低调"
}

TRACK_LABELS = {
    "competency": {2: "A3", 5: "D4", 8: "G3", 11: "J3", 14: "N3", 17: "Q3", 20: "T3", 23: "W8", 26: "Y2"},
    "reality": {0: "C4", 3: "L11", 7: "E2", 9: "O4", 13: "T6", 15: "V2", 19: "X3", 21: "H5", 25: "E3"},
    "anomaly": {0: "H4", 1: "H3", 4: "U2", 6: "X2", 10: "N1", 12: "Q2", 16: "L10", 18: "G8", 22: "A7"}
}

COMPETENCY_RANKS_TOP = {
    0: "实习生", 2: "助理", 5: "高级助理", 8: "助理总监", 11: "总监", 14: "区域总监"
}
COMPETENCY_RANKS_BOTTOM = {
    3: "主席", 6: "执行副总裁", 9: "高级副总裁", 12: "副总裁"
}

ANOMALY_ABILITIES_DATA = {
    "低语": [
        {"name": "再说一遍？", "trigger": "你可以对他人的口头陈述回复“再说一遍？”，然后向小组说明目标实际说出的话，而非他们最初所说的。掷【气质】骰", "quality":"气质", "success": "目标相信你所说的新句子正是他们原本想表达的", "fail": "目标不受影响。在接下来的三小时内，你只能使用你原本打算让他们说的那句话中的词语发言", "cost_effect": "如果出现六个或更多的“3”，你在接下来的一个小时内可以随时替目标发言", "question": "当有人打断我时，我会……", "answers": [{"text": "先相信他们是出于好意", "doc": "T2"}, {"text": "表达我的不满", "doc": "P4"}]},
        {"name": "舌尖上的秘密", "trigger": "张开你的心扉，聆听旁人的思绪。让他们的言语通过你传出，并掷【共情】", "quality":"共情", "success": "你会说出目标此刻希望自己说出的话", "fail": "你会承认一些你不希望任何人知道的秘密", "cost_effect": "每三个“3”，你可以就目标当前相关的事物提出一个问题，并从GM那里获得答案；这个问题及其答案必须由你的角色大声说出", "question": "当我需要融入某个地方时，我……", "answers": [{"text": "直接融入，表现得像自己本就属于这里", "doc": "A11"}, {"text": "在长时间的仔细侦查后逐步渗透", "doc": "B9"}]},
        {"name": "寂静", "trigger": "张开嘴巴，发出一种能调整频率以抵消你所制造的噪音的声音。掷【低调】骰", "quality":"低调", "success": "在你下一次掷骰或闭上嘴之前，你的一切行动都不会产生任何声音", "fail": "你的频率失去平衡。在接下来的一小时内，你制造的所有声音都会被大幅放大", "cost_effect": "每额外获得一个“3”，你可以使另外一名目标的行动保持无声，直至该效果结束", "question": "我安静下来是为了……", "answers": [{"text": "让别人发言", "doc": "S10"}, {"text": "让我接下来要说的话更为振聋发聩", "doc": "S8"}]}
    ],
    "编目": [
        {"name": "那边是什么？", "trigger": "指向附近某处并说：“那边是什么？”，然后掷【缜密】骰", "quality":"缜密", "success": "你在所指位置创造出一个物体。它可以是你想象中任何普通、无害且恰好能适应该空间的物品，但只能包含你所熟悉的细节或信息", "fail": "GM会描述一个格格不入或极为不便的物体", "cost_effect": "每额外获得一个“3”，你可以在附近再创造一个物体", "question": "我的朋友永远不会伤害我，因为……", "answers": [{"text": "他们不知道怎么伤害我", "doc": "Y1"}, {"text": "我雇了他们", "doc": "I5"}]},
        {"name": "你或许还会喜欢……", "trigger": "拿起任何一个你能携带的小物品，然后掷【活力】骰", "quality":"活力", "success": "该物体会变成一个类似但又有所不同的版本（例如，一件绿色外套变为蓝色外套，一个毛绒熊变为毛绒老虎，房间钥匙 #203 变为 #204，等等）", "fail": "该物体将被完全不同的物品取代，并且此后无法通过该能力更改", "cost_effect": "每三个“3”，你可以为该物体添加一个额外的变体，并在这些变体之间自由切换。例如让一根拐杖在拐杖和剑之间转换。此效果为永久性，但仅在你持有该物体时可进行切换", "question": "对我来说，顾客永远是……", "answers": [{"text": "错的", "doc": "L2"}, {"text": "对的", "doc": "J1"}]},
        {"name": "你最佳的自我", "trigger": "打开一个足够完全容纳你的容器，然后掷【欺瞒】骰", "quality":"欺瞒", "success": "一个你的替代版本会出现在容器内。这个替代自我拥有一项对你当前情境特别有用的技能（如削木、口哨、搅拌等）。在一小时内，他们将从你的世界中消失", "fail": "你所展现的替代版本在你看来是邪恶的。他们的目标和优先事项与你完全相反，并决心在你前进的路上不断设障，直到被解决。只有在他们对自己所造成的改变感到满意时，他们才会自愿离开你的世界", "cost_effect": "如果掷出六个或更多“3”，你可以创造出另一个替代自我", "question": "我的敌人的敌人是……", "answers": [{"text": "我的朋友", "doc": "Y5"}, {"text": "我", "doc": "P5"}]}
    ],
    "渴渠": [
        {"name": "还要再来点吗？", "trigger": "对你来说，欲望就像一个水桶。只需说一句“还要再来点吗？”便能在其中戳出一个洞。掷【共情】骰", "quality":"共情", "success": "与你交谈的对象会对他们最近享受过的那样东西（如关注、爱护、冰淇淋、休息等）产生浓厚兴趣，这一点由你和扮演该角色的玩家共同确认。这不会使他们上瘾或产生强迫症，但会使那件事变成远超其本身价值的筹码或干扰因素", "fail": "目标会对他们最近享受的那件事产生厌恶。你的建议对他们来说变成了一种侮辱。从此以后，即便只是想到那件事也令他们作呕", "cost_effect": "每额外获得一个“3”，你可以将这种欲望扩散给附近另一个目标，产生类似效果", "question": "我可以把马牵到水边……", "answers": [{"text": "但谁会去喝水呢？", "doc": "Y4"}, {"text": "不过我先喝！", "doc": "C1"}]},
        {"name": "借用", "trigger": "你可以从一个普通目标身上借取某个特征，并据为己有——无论是他们的面容、声音、爱情，还是指纹——现在这些都属于你，而对方则失去它们。请掷【欺瞒】骰", "quality":"欺瞒", "success": "这一效果可以持续长达一小时", "fail": "目标永久失去你所借走的特征，且无人拥有失去的特征。目标会记住他们失去的部分", "cost_effect": "每额外获得一个“3”，你可以从以下选项中选择一个：\n*目标保留一份有瑕疵的被借特征的副本\n*效果再延长一小时\n*你可以与另一目标共享所借特征", "question": "人们爱我是因为……", "answers": [{"text": "如果他们不爱我，我也能找到新的", "doc": "R9"}, {"text": "我确保自己完美无瑕", "doc": "S15"}]},
        {"name": "通用受体", "trigger": "当你受到伤害或以任何方式受损时，掷【坚持】骰", "quality":"坚持", "success": "选择一个在你附近的活人或异常（但不能是对你造成伤害的那个），让他们代替你受伤，而你则免受伤害", "fail": "你受到的痛苦会反弹回来，你将受到三倍的伤害。如果你死后仍有残余的伤害，该伤害会寻找附近的其他目标，直到所有伤害都得到传递", "cost_effect": "每额外获得一个“3”，你可以选择另外一个目标，使其也承受同样的伤害", "question": "当有人伤害我时……", "answers": [{"text": "这是汲取宝贵教训的契机", "doc": "S19"}, {"text": "他们不该这么做。他们为什么要这么做？", "doc": "B11"}]}
    ],
    "时计": [
        {"name": "我们还有时间", "trigger": "当你或目标急于完成一项任务（例如修车、逃离追捕等）时，查看任一时钟并说出“我们还有时间”。请掷【专业】骰", "quality":"专业", "success": "你说对了。如果专注且真诚地执行任务，它将在迫近的截止日期之前完成", "fail": "你大错特错——直到为时已晚你才发现这一点。你的追捕者会出其不意地袭击你，截止日期早已过去……时间都去哪了？", "cost_effect": "每额外获得一个“3”，你可以在截止日期前额外获得一分钟的准备时间，以便用于其他活动", "question": "我了解……", "answers": [{"text": "深奥的魔法", "doc": "W3"}, {"text": "功夫", "doc": "C10"}]},
        {"name": "抓紧时间", "trigger": "当你或盟友为除本能力以外的某项异常能力掷骰并见到结果后，用力击打一只时钟，然后掷【主动】骰", "quality":"主动", "success": "你将目标送回过去以协助自己，使其能够以相同数量的“3”再次使用同一能力。这第二次使用可影响新的目标，并且不会产生混沌或三重升华效应", "fail": "原始掷骰结果变为失败，随后该能力再次失败。第二次失败要么在同一目标上重复，要么转移到另一个目标上，以造成更严重后果为准。复制的失败不会产生混沌", "cost_effect": "每额外获得一个“3”，你可以在第二次使用中额外增加一个“3”，此效果甚至可使一次掷骰的“3”数量超过六个", "question": "我会在……入睡", "answers": [{"text": "我疲惫时", "doc": "P13"}, {"text": "我死去时", "doc": "O7"}]},
        {"name": "回忆过去", "trigger": "让某人感受到对逝去时光的强烈怀旧之情。哼一段旋律，并掷【共情】骰", "quality":"共情", "success": "所有过去的事件，即使是最近的，也显得遥远而充满感伤。目标迫切想要谈论他们的过去，并很容易被引导讨论你感兴趣的话题——即使那些话题通常是机密或受限的", "fail": "目标会迷失在自己的记忆中，情绪泛滥，变得对收集信息毫无作用。要将他们从回忆中拉回现实需要花费大量时间和精力，而他们的状态至少会产生一个松散端", "cost_effect": "每累计到第三个“3”，你可以要求GM用完美细致的方式描述某个特定记忆或事件过程，该描述不会受到记忆自然衰退的影响。这一效果甚至能揭示那些因异常导致的记忆阻塞或清除背后的信息", "question": "我更可能会问……", "answers": [{"text": "他们现在在哪？", "doc": "O6"}, {"text": "他们将要去哪？", "doc": "F3"}]}
    ],
    "生长": [
        {"name": "我来保护你！", "trigger": "当附近的目标将受到外部力量的伤害时，你可以说“我来保护你！”并延伸你的肉体去保护他们。请掷【坚持】骰", "quality":"坚持", "success": "你会迅速在目标周围生长出额外的肉体，替他们承受攻击。所有的损伤、伤害或死亡将转移给你，而非目标", "fail": "你和目标都会承受原本的伤害。你的身体会生长得超出你的意图，并以明显的过度生长状态存在，直到你至少有一小时的时间休息并恢复", "cost_effect": "每累计一个额外的“3”，你会为自己披上一层额外的保护肉体。每层保护肉体可抵消一点伤害，若有剩余的肉体则可保留到未来的伤害中（更高的数字会使你的身体出现明显的变化，直到那层肉体因吸收伤害而消耗掉）", "question": "我保护别人是因为……", "answers": [{"text": "我要让他们知道谁才是更强的", "doc": "F5"}, {"text": "他们无法保护好自己", "doc": "L6"}]}, #大幅修改了cost_effect：原版描述似乎是每三个3触发且一次只能抵消一点伤害，似乎不合理；我很可能没读懂规则书
        {"name": "多肢", "trigger": "长出与你现有肢体相似的新肢体以扩展你的身体能力。请掷【活力】骰", "quality":"活力", "success": "你获得的伸展范围和控制力远超普通战斗者，能够轻松将任何普通目标或次级异常目标拖入僵局", "fail": "你会变成仅由肢体组成的存在。你的其他特征消失，你变成一个你原本期望创造的肢体的集合体。你在接下来的一个小时内极其笨拙，且易受伤害", "cost_effect": "每累计一个额外的“3”，你可以从下列选项中选择一个：\n*解除一个目标的武装\n*同时牵制另一个目标\n*使一个已被牵制的目标失去意识\n*杀死一个失去意识的目标", "question": "当我撞到墙时，我……", "answers": [{"text": "吃掉墙", "doc": "S13"}, {"text": "跨过墙", "doc": "G9"}]},
        {"name": "多眼", "trigger": "张开更多的眼睛。请掷【专业】骰", "quality":"专业", "success": "你的身体会长出新的眼睛，并赋予你强大的新视觉能力", "fail": "你会看到“终结预兆”。你获得一段关于万物终结的禁忌知识，这知识超出你的心智所能承受的范围。从此，直到任务结束，你在所有掷骰时都会额外受到一次力竭", "cost_effect": "花费“3”来激活以下视觉效果，这些效果持续1小时：\n1. 热能视觉、夜视或望远视觉\n2. 指纹识别视觉或X光视觉\n3. 现实透视（能穿透幻象和障碍）\n4. 植物记号语言、异常追踪\n6. 弱点探测\n7. 预知未来", "question": "你见过“终结预兆”了吗？", "answers": [{"text": "没有。顺便提一嘴，我喜欢植物！", "doc": "G6"}, {"text": "是的（你只需要勾选一格“被熟知”方格即可解锁受限文档）", "doc": "R7"}]}
    ],
    "枪": [
        {"name": "抹除", "trigger": "你可以从当前局面中永久移除一个普通的物体或人。曾经他们存在；现在他们已不复存在。用你的枪瞄准，并掷【活力】骰", "quality":"活力", "success": "目标会无影无踪地消失", "fail": "目标被杀死。一个物体被摧毁，一个生物死亡。这一结果显而易见，且可能令人震惊", "cost_effect": "若掷出六个或更多“3”：选择你当前位置能看到的任意数量的目标，它们会无影无踪地消失", "question": "你会记住他们吗？（仅你自己回答这个问题）", "answers": [{"text": "不会", "doc": "S6"}, {"text": "会", "doc": "T5"}]},
        {"name": "快枪出击", "trigger": "当有人试图伤害你时，立即开火，并掷【主动】骰", "quality":"主动", "success": "你抢先开火，袭击者在发动攻击前会先受到一点伤害，他们的攻击也因此无法伤害到你", "fail": "你走火了，导致对你来说重要的人或事物受到损害，而原本针对你的攻击照常进行", "cost_effect": "每额外获得一个“3”，你可以选择另一个目标，使其受到伤害，或对已经被此能力伤害过的目标进行抹除", "question": "我……开枪", "answers": [{"text": "谨慎", "doc": "G4"}, {"text": "立刻", "doc": "A12"}]},
        {"name": "明火携带", "trigger": "你的枪所带来的威胁如此巨大，以至于普通人也能感知到。表明你的选择，并掷【气质】骰", "quality":"气质", "success": "你选择的目标因受到足够的威慑而按你的要求行事。然而，GM将通过掷骰选择一项目标的反应：*记住你的面孔 *联系当局 *极度恐惧地反应 *寻求报复", "fail": "目标毫不畏惧，免疫你的枪的所有效果，并可能立即以危险的方式实施报复", "cost_effect": "每额外获得一个“3”，你可以移除一个可能的后果选项，或增加一个目标。例如，掷出六个“3”可能意味着没有后果且有两个目标，或者五个目标但所有潜在后果均适用", "question": "朋友们……", "answers": [{"text": "无所不在，取决于你的视角", "doc": "D6"}, {"text": "只不过是还没成为我敌人的人", "doc": "W11"}]}
    ],
    "梦境": [
        {"name": "噩梦", "trigger": "将自己投射到某种超越现实的事物中。选择一种思想并沉浸其中，让它影响你。请掷【气质】骰", "quality":"气质", "success": "你可以以一种虚幻的形态出现在目标面前。该形态可能是可怕的、美丽的，或平凡无奇的——而目标会相信这就是你的真实形态", "fail": "你的真实身份烙印在目标的心中——夜晚他们会梦见你，白天他们会想起你。至于今天，也许什么都不会发生", "cost_effect": "每累计到第三个“3”，你可以要求扮演目标的玩家在你采取此形态之前，说出下列选项中的一个：\n*他们最深的恐惧\n*他们最大的目标\n*他们最隐秘的渴望", "question": "我倾向于想象……", "answers": [{"text": "最好的情况", "doc": "D1"}, {"text": "最坏的结果", "doc": "R13"}]},
        {"name": "午睡时光", "trigger": "向目标身上撒一把细沙，并掷【低调】骰", "quality":"低调", "success": "你使目标突然陷入沉睡。他们会做美梦，醒来后以为自己是自然打盹了几分钟", "fail": "另一名目标、一个盟友，甚至可能是你自己，会被迫陷入沉睡。变幻莫测的沙粒旋转着，而原本的目标则清楚地看到你所做的一切", "cost_effect": "每额外获得一个“3”，选择一项:\n*将此效果扩展至另外一个目标\n*该效果再延长一小时", "question": "我最喜欢的梦……", "answers": [{"text": "反复出现", "doc": "D8"}, {"text": "完全出人意料", "doc": "S1"}]},
        {"name": "实地参观", "trigger": "你的想象力足够真实。走进一幅画、一张照片、一段视频、一部小说或其他艺术作品中，并掷【缜密】骰", "quality":"缜密", "success": "你和你选择的附近任何盟友将进入那幅作品描绘的世界。在其中，你可以操控物体，与人物交谈，并以原始画面中未曾展示的角度观察世界", "fail": "你忘记了如何掩盖自己的行踪。来自附近艺术作品中的投机角色可能会跟随你，并自行进入现实世界", "cost_effect": "每累计到第三个“3”，选择一项：\n*你和你的盟友改变外貌以融入那件艺术品中\n*当你离开时，这件艺术品恢复到原始状态", "question": "当我读完一个故事，我常常希望自己能……", "answers": [{"text": "花更多时间和角色相处", "doc": "P8"}, {"text": "把其中的道理分享给需要的人", "doc": "M4"}]}
    ],
    "流形": [
        {"name": "我知道捷径！", "trigger": "当你急于赶往某处时，说出“我知道捷径！”并描述一条通向目标地点的捷径。请掷【主动】骰", "quality":"主动", "success": "不论捷径看起来多不可能，你指的路线都对你有效。这条捷径使用过后便会消失", "fail": "你的捷径会引导到一个极为不便的地方，而非目标地点；这条捷径会持续存在，且对双向都公开可见", "cost_effect": "每额外获得一个“3”，另外一人可以在捷径消失前使用它", "question": "世界……", "answers": [{"text": "如我所见", "doc": "F9"}, {"text": "如我所造", "doc": "S16"}]},
        {"name": "继续前行……", "trigger": "当你为某人指路、逃离追捕者或知道某人的去向时，你可以尝试将他们困在一个迷宫或无尽的走廊中。打个结，然后掷【坚持】骰", "quality":"坚持", "success": "你将他们困在你设计的复杂而循环重复的路径中。他们在你再次掷骰前无法脱身", "fail": "你会立即加速他们前往目的地——他们马上到达目标，或者立刻追上你", "cost_effect": "每额外获得一个“3”，你可以额外困住一个目标，或使迷宫延续更多次掷骰", "question": "我花时间和对方在一起的人是……", "answers": [{"text": "我想要理解的人", "doc": "A5"}, {"text": "和我一样的人", "doc": "M9"}]},
        {"name": "旋转万向架", "trigger": "调整你的平衡，并掷【专业】骰", "quality":"专业", "success": "你可以将重力方向改变至你选择的方向，最多可改变90度。如果你在室内，次效果只影响该房间；如果在室外，则影响大约30码范围内的一切。此效果持续到你下一次掷骰", "fail": "你会失去重力的束缚。在至少一小时内，你的身体仿佛置身于零重力环境。任何看到这一幕的人都会成为松散端", "cost_effect": "每额外获得一个“3”，选择一项：\n*该变化不影响某个单一目标，例如你自己\n*对单一目标而言，作用范围无限\n*对单一目标而言，重力旋转角度超过90度", "question": "身处危机时，我……", "answers": [{"text": "逃离", "doc": "P6"}, {"text": "战斗", "doc": "S18"}]}
    ],
    "缺失": [
        {"name": "没打中！", "trigger": "他们似乎永远不知道你身处何处。当有东西可能触碰或伤害你时，你可以喊出“没打中！”并掷【欺瞒】骰", "quality":"欺瞒", "success": "你总是在附近的别处——也许就在试图触碰你的东西的后面或上方", "fail": "目标会被移动到其他地方——可能去伤害别人、处于一个会产生额外伤害的角度，或被送到一个极为不便的位置", "cost_effect": "每额外获得一个“3”，你可以使另一名愿意且位于附近的目标与你一同移动到新的位置", "question": "我赢得争论是靠……", "answers": [{"text": "指出逻辑漏洞", "doc": "I2"}, {"text": "永不妥协", "doc": "M10"}]},
        {"name": "反溯", "trigger": "检查曾经存在某物的位置。请掷【缜密】骰", "quality":"缜密", "success": "你能看见你所检查地点的丢失物品的历史。如果有便条被移走，你会知道其内容；如果有物品被盗，你会知道它是什么以及它是如何消失的", "fail": "这里存在太多失去的东西。你会被所在地点的历史所压倒，并受到1点伤害，外加因你明显而痛苦的反应而产生的任何松散端", "cost_effect": "每累计到第三个“3”，你可以说出一句描述失去之物的陈述，这句话绝对真实", "question": "为了填补空白，我通常会……", "answers": [{"text": "找话聊", "doc": "W5"}, {"text": "占据更多空间", "doc": "C6"}]},
        {"name": "无界", "trigger": "如果有事物挡住了你的路或拖累你，放松身体并掷【低调】骰", "quality":"低调", "success": "你能直接穿过阻挡物，变得无形，在接下来的一小时内可轻松穿越墙壁、链条和其他障碍", "fail": "你失去对身体形态的控制，变得极度不稳定。你将无法感知、握持或与物理物体互动。但在任务剩余期间或死亡前，你仍可能受到伤害", "cost_effect": "每累计到第三个“3”，选择一项： \n*你变得隐形\n*你变得无法被听见\n*你在某个观察者眼中变得难以被记住\n*每当你使用此能力穿越障碍时，你可以带上一个人同行", "question": "我更想……", "answers": [{"text": "分散他人注意力", "doc": "U3"}, {"text": "卧底", "doc": "O3"}]}
    ],
    "default": [
        {"name": "能力一", "trigger": "触发条件...", "success": "成功效果...", "fail": "失败后果...", "cost_effect": "额外效果...", "question": "关于能力的问题...", "answers": [{"text": "", "doc": ""}, {"text": "", "doc": ""}]},
        {"name": "能力二", "trigger": "触发条件...", "success": "成功效果...", "fail": "失败后果...", "cost_effect": "额外效果...", "question": "关于能力的问题...", "answers": [{"text": "", "doc": ""}, {"text": "", "doc": ""}]},
        {"name": "能力三", "trigger": "触发条件...", "success": "成功效果...", "fail": "失败后果...", "cost_effect": "额外效果...", "question": "关于能力的问题...", "answers": [{"text": "", "doc": ""}, {"text": "", "doc": ""}]}
    ]
}

COMPETENCY_REQUISITIONS_DATA = {
    "公关": [
        {"name": "印刷新闻稿", "code": "101", "effect": "这台古老而笨重的印刷机存放于总部某个废弃楼层的旧休闲室中。在每次任务中，你可以使用它一次，印刷并立刻投放你的稿件至所有本地主要媒体刊物。如果你需要随时行动，也可将你的稿件交由部门同事去操作印刷机"}
    ],
    "研发": [
        {"name": "橡皮小黄鸭", "code": "103", "effect": "这只洗澡玩具内部的“吱吱声”暗示着巨大可能性。每次任务你可以使用它一次：先描述你想要达成的结果，然后将此结果说给这个口袋大小的橡皮鸭听。这只小鸭会开口：你的GM将告诉你达成该结果所需的3个步骤。无论看起来多么不可能，这一结果都将变得切实可行。如果你询问橡皮鸭关于异常的信息，它会融化成一团无用的泡沫"}
    ],
    "咖啡师": [
        {"name": "三重浓缩杯", "code": "105", "effect": "这只三重浓缩杯来自密库咖啡厅。每次任务你可以使用它一次：只要用这只杯子在任意浓缩机上萃取咖啡，并将萃取出来的咖啡倒入一具尸体的口中，即可让其复活10分钟，无论该尸体是异常或普通人。不过，他们无法承受任何数量的伤害"}
    ],
    "CEO": [
        {"name": "报销账户", "code": "107", "effect": "这本巨大的会计账簿传言记载了人类历史上所有的交易记录。在每次任务中，你有一次机会将某样特定的物品记入账簿，使其纳入机构资产。你可以在本次任务中使用它，但此后，关于该物品的处置权归机构所有"}
    ],
    "实习生": [
        {"name": "继承的名牌", "code": "109", "effect": "所有实习生都会领到一包无限量的空白名牌。每次任务你可以使用一次：将当日新认识的某个人的名字写在名牌上，并将其贴在你身上；之后，除了其他特工以外的所有人都会把你当作名牌上的那个人，直到你摘下名牌"}
    ],
    "掘墓人": [
        {"name": "德古拉的棺材", "code": "111", "effect": "这具传奇人物的棺材深埋于密库的土层之下。在每次任务中你可以将棺材挖出一次，将能放得下的某个事物置入其中。当棺材重新埋入土中后，你所埋葬的事物将从未存在——所有关于它的记忆都被抹消，而它曾对世界造成的影响也会被归因于其他因素"}
    ],
    "前台接待": [
        {"name": "莫比乌斯回路电视", "code": "113", "effect": "在密库深处有一间由无数电视屏幕组成的“无尽房间”。每次任务你可以使用一次：用任意联网装置呼叫其中一台电视的画面，查看至多30分钟、来自你今天曾到访过的地点的任意时刻的影像"}
    ],
    "客服": [
        {"name": "等候音", "code": "115", "effect": "你拥有一台功能强大的卡带机，内附一个带有平静且愉悦的音乐的卡带。每次任务你可使用一次：按下播放键后，你与附近盟友即刻传送至一个绝对安全的候客室，可停留最多1小时。回到原处时，所有受影响者可选择回到离开前的房间中的任意位置，而外部世界并未流逝任何时间"}
    ],
    "小丑": [
        {"name": "愚人帽", "code": "117", "effect": "每次任务，你可使用一次机构颁发的小丑专属愚人帽。戴上后的一分钟内，你无论做什么都能让在场的观众捧腹，一切行为都变得极具娱乐性。在这分钟结束后，所有普通人都会带着愉悦的回忆看待你刚才的行为。但这并不能防止那些之后才看到后果的人对此做出评判"}
    ],
    "default": [
        {"name": "补给名称", "code": "333", "effect": "效果描述……"}
    ]
}

EMPTY_ABILITY_TEMPLATE = {
    "name": "", "trigger": "", "quality": "", 
    "success": "", "fail": "", "cost_effect": "",
    "question": "", "practiced": False,
    "answers": [{"text":"", "doc":""}, {"text":"", "doc":""}]
}

WEATHER_EFFECTS = {
    1: {
        "a": "细雨绵绵",
        "b": "倾盆大雨",
        "c": "咆哮的暴风雨"
    },
    2: {
        "a": "特工们的新任务与他们之前执行过的任务完全相同，每个细节都一模一样。除了外勤小队之外，包括机构在内的所有人都不记得这件事曾经发生过",
        "b": "特工们的新任务与他们之前执行过的任务完全相同，每个细节都一模一样，只是所有重要人物（异常、相关 NPC）的数量变为两倍。除了外勤小队之外，包括机构在内的所有人都不记得这件事曾经发生过。复制体们协作达成目标，但互不理睬，也不在意自己作为复制体的存在",
        "c": "特工们醒来时发现自己正以之前任务中关键参与者的身份生活。他们必须按照该任务流程行动，直到他们真实的自我到达并捕捉异常为止。他们所改变的任何事情也会在原本任务的时间线中同步改变，这可能对之后的时间产生连锁反应"
    },
    3:{
        "description":"松散端定位成功！机构员工移除1个松散端"
    },
    4: {
        "a": "每个人都不愿离开他们的汽车。在本次任务期间，人们尽可能多地待在车里",
        "b": "同4a，但附加：人们无论出于什么原因都不愿意离开汽车。被迫离开的人会尽一切可能回到车内。没有车的人醒来后会发现自己拥有一辆车。人们的汽车还配备了有趣设施，如外置机械臂和适度的垂直跳跃功能",
        "c": "在本次任务期间，世界上的每个人都变成了拟人化的汽车（他们不记得曾有其他形态）"
    },
    5: {
        "a": "内疚沉重地笼罩着这个世界。该分部周边区域的所有居民都倾向于道歉和懊悔。特工只要为他们真心后悔的事情诚挚道歉，就能从混沌池中移除5点混沌",
        "b": "同5a，但附加：宽恕变得不可能。在本次任务期间，所有人都无法原谅他人",
        "c": "审判在注视。私下询问每位特工三件他们认为很糟糕的事。如果有人表现出这些行为中的任何一项，他们将立即死亡"
    },
    6:{
        "description":"松散端定位成功！机构员工移除2个松散端"
    },
    7: {
        "a": "特工与异常的连接暂时增强。在本次任务期间，特工可以不受距离限制地互相传递异常能力",
        "b": "特工的异常与周围世界的连接更加深入。与 7a 相同，且附加：特工可以通过他们的人际关系传递异常能力，并从对方的角度使用这些能力。该能力的失败效果和其他影响同样应用于传递效果的人",
        "c": "同7b，但附加：在本次任务期间，每位特工可使用核心规则手册中所有初始异常能力"
    },
    8: {
        "a": "阳光明媚",
        "b": "刺眼、迅速灼烧的阳光",
        "c": "太阳的色调发生了变化。暴露在光照下会引起生物体的奇异变化"
    },
    9:{
        "description":"松散端定位成功！机构员工移除3个松散端"
    },
    10: {
        "a": "该区域内随机涌现的思绪开始表现为涟漪。特别强烈的想法或情绪会形成表现该情感的微小、具有攻击性的具象，拥有 1 点威胁度和 1 点稳定度",
        "b": "同10a，但附加：消耗混沌会产生相应数量的涟漪。最近在桌上说出的句子会被具象化为带有 1 点威胁度和 1 点稳定度的微小攻击性怪物",
        "c": "当本次任务开始时，区域内将涌现1000个涟漪。每个被发现并击败的涟漪都会被遗忘，其行为只会以侵入性思绪或不幸巧合的形式被记住"
    },
    11: {
        "a": "特工们醒来时会经历彼此的生活。在本次任务期间，他们的现实和人际关系将被随机互换",
        "b": "在本次任务中，每位特工第一次看到某段人际关系时，该关系将被替换为由通常扮演该角色的特工所构成的版本，该关系与原关系对该特工的意义相同",
        "c": "在本次任务期间，所有玩家将扮演其他玩家的特工"
    },
    12:{
        "description":"松散端定位成功！机构员工移除4个松散端"
    },
    13:{
        "description":"倒霉！你的总经理角色已死亡，必须用新的替换"
    },
    14: {
        "a": "特工可以随时激活异常能力的失败效果，无需掷骰且不会生成混沌",
        "b": "与 14a 相同，且附加：每次激活失败效果可以从混沌池中移除3点混沌",
        "c": "与 14b 相同，且附加：每当通过掷骰激活成功或失败效果时，同时也激活相反的效果"
    },
    15:{
        "description":"松散端定位成功！机构员工移除5个松散端"
    },
    16: {
        "a": "空气中弥漫着刺骨的寒意",
        "b": "地面上开始结雪，并且雪花逆向飘向云端",
        "c": "一只由冰雪构成的巨大飞鸟——焦点为“对冬季里的挑战不满”的异常——在你所属分部覆盖区域的最高点安家落户。你的区域将经历不合时宜的寒冷、狂风和深厚的积雪，直至采取改善措施"
    },
    17: {
        "a": "在本次任务期间，人们经常接近或出现在具有他们的理想化特质的动物旁",
        "b": "同 17a，但附加：动物以人们能理解的语言与人们交流（它们仍然是动物）",
        "c": "世界一夜之间发生了变化。在本次任务期间，世界上没有人类或拟人角色，所有人都变成了会说话的动物（人们不记得曾有其他形态）"
    },
    18:{
        "description":"松散端定位成功！机构员工移除6个松散端"
    },
    19: {
        "a": "一个之前被捕获或中和的异常被重塑为“空洞体”——这是原始异常的不稳定版本，若它能杀死一名特工并吸收其共鸣，则该空洞体将变得稳定且永久。该空洞体在本次任务中协助任务目标",
        "b": "两个之前被捕获或中和的异常被重塑为“空洞体”——这是原始异常的不稳定版本，若它能吞噬一名特工，则该空洞体将变得稳定且永久。该空洞体在本次任务中协助任务目标",
        "c": "三个之前被捕获或中和的异常被重塑为“空洞体”——这是原始异常的不稳定版本，若它能吞噬一名特工，则该空洞体将变得稳定且永久。该空洞体在本次任务中协助任务目标"
    },
    20:{
        "description":"知识扩散。增加3个松散端"
    },
}

HIDDEN_DICE_DB = {
    "G3": {
        "name": "赞助骰",
        "desc": "从现在开始，在请求机构调整现实时，你需要额外投掷这个八面骰。这个骰子掷出的3的数量可以被记入、减去或忽略，从而提高6d4掷骰的成功率并扩大激活三重升华的机会\n\n如果你没有投出三的倍数，请参考下方列表，在因果链中包含特定内容，否则你的请求一定会失败\n\n1. 描述40小时前发生在某个地点或目标身上的某件影响因果链的事\n2. 描述发生在其他国家、对因果链产生影响的某个事件\n3. 一个3\n4. 描述某部虚构作品影响因果链的方式\n5. 描述“Wet Mouth Brand Chewing Gum & Dietary Supplement”影响因果链的方式（包含完整的品牌名）\n6. 两个3\n7. 在因果链中加入忧伤元素\n8. 在因果链中加入背叛元素",
        "key": "sponsorship"
    },
    "N1": {
        "name": "十面骰",
        "desc": "在使用异常能力前，你可以决定是否使用这枚骰子。该骰子可以与六面骰组合使用。此骰子可以激活UNL3ASH效果但无法激活三重升华；掷出3将导致本次掷骰失败。可以用一点QA或者三点处分使掷出的点数增加或减少1。燃尽仍然会减少掷出的3的数量并增加混沌值\n\n骰子掷出的数字等于掷出的3的数量和混沌数量，具体见下表\n\n1. 一个3，一点混沌\n2. 两个3，两点混沌\n3. 三点混沌，且本次掷骰失败，忽视其他的掷骰结果或燃尽\n4. 四个3，四点混沌\n5. 五个3，五点混沌\n6. 六个3，六点混沌\n7. 七个3，七点混沌（如果这是掷出的唯一骰子，激活UNL3ASH效果）\n8. 八个3，八点混沌\n9. 九个3，九点混沌\n10. 十个3，十点混沌",
        "key": "10-sided"
    },
    "U2": {
        "name": "六面骰",
        "desc": "在使用异常能力前，你可以决定是否使用这枚骰子。所有规则保持不变（例如触发三重升华）。你可以用一点QA或是三点处分将此骰子的结果调整为任意值。如果你在单次掷骰中获得七个3（在任何调整之前，比如QA，处分，燃尽等），可激活UNL3ASH\n\n1. 增加一点混沌\n2. 增加一点混沌\n3. 增加一个3\n4. 增加一点混沌\n5. 增加一点混沌\n6. 增加两个3",
        "key": "6-sided"
    }
}